a) Read the dataset (CSV) into a Pandas DataFrame.

In [2]:
import pandas as pd

df = pd.read_csv("test.csv")
print(df.head())

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0  34.5      0      0   330911   7.8292   NaN        Q
1  47.0      1      0   363272   7.0000   NaN        S
2  62.0      0      0   240276   9.6875   NaN        Q
3  27.0      0      0   315154   8.6625   NaN        S
4  22.0      1      1  3101298  12.2875   NaN        S

b) Write the loaded DataFrame into two additional formats: (a) Excel (.xlsx)

In [8]:
df_excel=df.to_excel('train_excel.xlsx')
print(df_excel)

None

In [9]:
df_json=df.to_json('new.json')
print(df_json)

None

c) Read the dataset back from each format (CSV, Excel, JSON) into new DataFrames and verify consistency (e.g., shape, column names, basic value checks).

In [ ]:
df3=pd.read_csv('test.csv')
df_json2=pd.read_json('new.json')
df_excel2=pd.read_excel('train_excel.xlsx')

In [15]:
#verify consistency

print('CSV_Shape',df3.shape)
print('json_Shape',df_json2.shape)
print('excel_shape',df_excel2.shape)

CSV_Shape (418, 11)
json_Shape (418, 11)
excel_shape (418, 12)

In [23]:
# columns
print('CSV columns',df3.columns.tolist())
print('json columns',df_json2.columns.tolist())
print('excel columns',df_excel2.columns.tolist())

CSV columns ['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
json columns ['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
excel columns ['Unnamed: 0', 'PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [27]:
print(df3.head(3))
print(df3.tail(5))
print(df_json2.head(5))
print(df_excel2.head(3))

   PassengerId  Pclass                              Name     Sex   Age  SibSp  \
0          892       3                  Kelly, Mr. James    male  34.5      0
1          893       3  Wilkes, Mrs. James (Ellen Needs)  female  47.0      1
2          894       2         Myles, Mr. Thomas Francis    male  62.0      0

   Parch  Ticket    Fare Cabin Embarked
0      0  330911  7.8292   NaN        Q
1      0  363272  7.0000   NaN        S
2      0  240276  9.6875   NaN        Q
     PassengerId  Pclass                          Name     Sex   Age  SibSp  \
413         1305       3            Spector, Mr. Woolf    male   NaN      0
414         1306       1  Oliva y Ocana, Dona. Fermina  female  39.0      0
415         1307       3  Saether, Mr. Simon Sivertsen    male  38.5      0
416         1308       3           Ware, Mr. Frederick    male   NaN      0
417         1309       3      Peter, Master. Michael J    male   NaN      1

     Parch              Ticket      Fare Cabin Embarked
413      0           A.5. 3236    8.0500   NaN        S
414      0            PC 17758  108.9000  C105        C
415      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416      0              359309    8.0500   NaN        S
417      1                2668   22.3583   NaN        C
   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0  34.5      0      0   330911   7.8292  None        Q
1  47.0      1      0   363272   7.0000  None        S
2  62.0      0      0   240276   9.6875  None        Q
3  27.0      0      0   315154   8.6625  None        S
4  22.0      1      1  3101298  12.2875  None        S
   Unnamed: 0  PassengerId  Pclass                              Name     Sex  \
0           0          892       3                  Kelly, Mr. James    male
1           1          893       3  Wilkes, Mrs. James (Ellen Needs)  female
2           2          894       2         Myles, Mr. Thomas Francis    male

    Age  SibSp  Parch  Ticket    Fare Cabin Embarked
0  34.5      0      0  330911  7.8292   NaN        Q
1  47.0      1      0  363272  7.0000   NaN        S
2  62.0      0      0  240276  9.6875   NaN        Q

d) Append a few new passenger rows to each format (CSV, Excel, JSON). Reload each file and confirm that the newly appended rows are present.

In [46]:
new_passanger=pd.DataFrame([{
    'PassengerId':891,
    'Pclass':3,
    'Name': 'Abhishek kumar ',
    'Sex': 'male',
    'Age': 21.0,
    'SibSp': 1,
    'Parch': 0,
    'Ticket': 1,
    'Fare':  9.0,
    'Cabin': 'cupa' ,
    'Embarked': 'S'
}])

updated_df=pd.concat([df,new_passanger])
print(updated_df.tail())

     PassengerId  Pclass                          Name     Sex   Age  SibSp  \
414         1306       1  Oliva y Ocana, Dona. Fermina  female  39.0      0
415         1307       3  Saether, Mr. Simon Sivertsen    male  38.5      0
416         1308       3           Ware, Mr. Frederick    male   NaN      0
417         1309       3      Peter, Master. Michael J    male   NaN      1
0            891       3               Abhishek kumar     male  21.0      1

     Parch              Ticket      Fare Cabin Embarked
414      0            PC 17758  108.9000  C105        C
415      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416      0              359309    8.0500   NaN        S
417      1                2668   22.3583   NaN        C
0        0                   1    9.0000  cupa        S

In [ ]:
updated_df.to_csv('appendedtest.csv')
updated_df.to_excel('appendedtrain.xlsx')
updated_df.to_json('appended.json',orient="records", lines=False)

In [ ]:
df5=pd.read_csv('appendedtest.csv')
df6=pd.read_excel('appendedtrain.xlsx')
df7=pd.read_json('appended.json')

df5.tail()
df6.tail()
df7.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,None,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,None,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,None,C
418,891,3,Abhishek kumar,male,21.0,1,0,1,9.0000,cupa,S

e) Briefly compare the structural differences among CSV, Excel, and JSON (e.g., schema
fidelity, metadata, readability, typical use-cases).